#pragma once
#include "Ingredients.h"

class Dish : public Ingredients
{
protected:
	int result = 0;//сума по чеку
	void Pdish();//метод страв
	int CountMoney(int n);
	std::map<std::string, int> soup =//контейнер де зберігається страва і її ціна за мінімальну порцію
	{
		{"Борщ",60},
		{"Суп",60},
		{"Шурпа",90},
		{"Уха",90},
		{"Росольник",90},
	};
	std::map<std::string, int> gar =//контейнер де зберігається страва і її ціна за мінімальну порцію
	{
		{ "Гречка", 60 },
		{ "Рис",60 },
		{ "Пшено",60 },
		{ "Пельмени",70 },
		{ "Вареники",70 },
	};
	std::map<std::string, int> salad =//контейнер де зберігається страва і її ціна за мінімальну порцію
	{
		{"Греческий салат",80},
		{"Салат Цезарь",80},
		{"Салат Бунито",80},
		{"Салат Марго",85},
		{"Салат Дамский",85},
	};
	std::map<std::string, int> desert =//контейнер де зберігається страва і її ціна за мінімальну порцію
	{
		{"Мороженое",60},
		{"Торт Наполеон",75},
		{"Штруделль",70},
		{"Шоколадный торт",80},
		{"Чизкейк",70},
	};
	std::map<std::string, int> drink =//контейнер де зберігається страва і її ціна за мінімальну порцію
	{
		{"Лимонад",60},
		{"Сок",60},
		{"Cola",60},
		{"Pepsi",60},
		{"Квас",60},
	};
	std::map<std::string, int> alko =//контейнер де зберігається страва і її ціна за мінімальну порцію
	{
		{"Ром",95},
		{"Пиво",60},
		{"Коньяк",95},
		{"Виски",95},
		{"Вино",80},
	};
};

